---
type: Chapter
author: J. Pontes, N. Mangiavacchi e G. R. Anjos. 
editor: F. Moura Neto, G. Platt, I. N. Bastos, M. Rocha e N. Henderson
title: Estabilidade hidrodin&acirc;mica em c&eacute;lulas eletroqu&iacute;micas. 
book: Modelagem Computacional em Materiais
volume: 1  
chapter: 1
pages: 27--46. 
publisher: Editora Ciencia Moderna
year: 2010 
isbn: 9788573939576
file: chapter/cienciaModerna-001.pdf
tags:
    - electrochemical cells
    - chemical oscillations
    - hydrodynamic stability
    - rotating disk flow
---

# Modelagem Computacional em Materiais (Editora Ciencia Moderna)

<br>

# ABSTRACT:

Este trabalho aborda a estabilidade linear da solu&ccedil;&atilde;o
cl&aacute;ssica do campo hidrodin&acirc;mico que se forma na
vizinhan&ccedil;a de um disco rotat&oacute;rio de grande di&acirc;metro,
modificado pelo acoplamento, atrav&eacute;s da viscosidade, com o de
concentra&ccedil;&atilde;o de uma esp&eacute;cie qu&iacute;mica. A
configura&ccedil;&atilde;o refere-se a c&eacute;lulas
eletroqu&iacute;micas que utilizam eletrodos de disco rotat&oacute;rio
de ferro, os quais se dissolvem na solu&ccedil;&atilde;o 1~$\mathbf{M}$
de $\mathbf{H_2SO_4}$ do eletr&oacute;lito. As curvas de
polariza&ccedil;&atilde;o obtidas nessas c&eacute;lulas apresentam uma
instabilidade no in&iacute;cio da regi&atilde;o em que corrente &eacute;
controlada pelo transporte hidrodin&acirc;mico. A instabilidade surge em
um certo valor do potencial aplicado e &eacute; suprimida acima de
outro, mais alto. A dissolu&ccedil;&atilde;o do eletrodo d&aacute;
origem a uma camada limite de concentra&ccedil;&atilde;o cuja espessura
&eacute; de cerca de 4\% da hidrodin&acirc;mica. A camada limite de
concentra&ccedil;&atilde;o aumenta a viscosidade da
solu&ccedil;&atilde;o na interface e diminui o coeficiente de
difus&atilde;o no eletr&oacute;lito, acoplando os dois campos e afetando
a hidrodin&acirc;mica do problema. Como a corrente &eacute; proporcional
ao gradiente interfacial de concentra&ccedil;&atilde;o dos &iacute;ons
da esp&eacute;cie qu&iacute;mica que a transporta, a instabilidade dos
campos acoplados pode resultar na instabilidade observada
experimentalmente. Esse trabalho discute os resultados dos estudos
conduzidos no Departamento/Programa de
P&oacute;s-gradua&ccedil;&atilde;o em Engenharia Metal&uacute;rgica e de
Materiais da Universidade Federal do Rio de Janeiro, juntamente com o
Programa de P&oacute;s-gradua&ccedil;&atilde;o em Engenharia
Mec&acirc;nica da Universidade Estadual do Rio de Janeiro/Grupo de
Estudos e Simula&ccedil;&otilde;es Ambientais em Reservat&oacute;rios.
Os resultados mostram que aumentos de cerca de 2\% na viscosidade
interfacial provoca importante redu&ccedil;&atilde;o na estabilidade de
modos existentes em configura&ccedil;&otilde;es de viscosidade
constante. Aumentos sucessivos da viscosidade interfacial conduzem
&agrave; emerg&ecirc;ncia de nova regi&atilde;o inst&aacute;vel,
localizada em n&uacute;meros de Reynolds muito inferiores ao limite de
estabilidade da regi&atilde;o j&aacute; conhecida. A amplitude de
oscila&ccedil;&atilde;o da concentra&ccedil;&atilde;o de modos
inst&aacute;veis da nova regi&atilde;o &eacute; muito maior do que a
amplitude de oscila&ccedil;&atilde;o das vari&aacute;veis
hidrodin&acirc;micas correspondentes. Os modos inst&aacute;veis de
concentra&ccedil;&atilde;o se confinam em uma camada limite muito mais
fina do que a hidrodin&acirc;mica, o que resulta em
oscila&ccedil;&otilde;es do gradiente de concentra&ccedil;&atilde;o
interfacial que nos parecem suficientemente altas para causar as
oscila&ccedil;&otilde;es de corrente observadas nos experimentos. Os
resultados num&eacute;ricos mostram que o aumento progressivo da
viscosidade interfacial provoca inicialmente uma redu&ccedil;&atilde;o
da estabilidade do campo, mas que al&eacute;m de certo limite, as
propriedades de estabilidade de fluidos com viscosidade constante
s&atilde;o recuperadas, o que sugere que esse mecanismo pode ser o
respons&aacute;vel pela supress&atilde;o das oscila&ccedil;&otilde;es de
corrente, quando o potencial aplicado ultrapassa certo valor. S&atilde;o
discutidas tamb&eacute;m as solu&ccedil;&otilde;es e os primeiros
resultados obtidos com um c&oacute;digo para simula&ccedil;&atilde;o
num&eacute;rica direta do problema, desenvolvido em nosso grupo.

[download][1]

[1]:{{media_url('pdf/publications/chapter/cienciaModerna-001.pdf')}}


